app/Controllers/Libros.php

    public function index()
    {
        $model = new LibroModel();
        $data['libros'] = $model->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `libros`
ORDER BY `id` ASC

    public function editar($id = null)
    {
        //--->Para saber si llega el id ---> print_r($id);

        $model = new LibroModel();
        $data['libro'] = $model->where('id', $id)->first();
---
SELECT *
FROM `libros`
WHERE `id` = '1'
 LIMIT 1

    public function borrar($id = null)
    {
        $model = new LibroModel();
        $data = $model->where('id', $id)->first();

        $model->where('id', $id)->delete($id);
---
SELECT *
FROM `libros`
WHERE `id` = '53'
 LIMIT 1
DELETE FROM `libros`
WHERE `id` = '53'
AND `id` IN ('53')

    public function buscar_nombre()
    {
        $data['cabecera'] = view('template/cabecera');
        $data['pie'] = view('template/pie_de_pagina');

        $model = new LibroModel();

        $query = $this->request->getVar('query');
        $data['resultado'] = $model->where('nombre', $query)->findAll();
---
SELECT *
FROM `libros`
WHERE `nombre` = 'GRILLO'

    public function buscar_autor()
    {
        $data['cabecera'] = view('template/cabecera');
        $data['pie'] = view('template/pie_de_pagina');

        $model = new LibroModel();

        $query = $this->request->getVar('query');
        $data['resultado'] = $model->where('autor', $query)->findAll();
---
SELECT *
FROM `libros`
WHERE `autor` = 'Andrzej Sapkowski'

    public function buscar_id()
    {
        $data['cabecera'] = view('template/cabecera');
        $data['pie'] = view('template/pie_de_pagina');

        $model = new LibroModel();

        $query = $this->request->getVar('query');
        $data['resultado'] = $model->where('id', $query)->findAll();
---
SELECT *
FROM `libros`
WHERE `id` IS NULL